result/wrk111-1593405366.txt
Running 1m test @ http://192.168.1.4/index111.html
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms  675.95us   7.62ms   85.82%
    Req/Sec     2.49k   168.57     3.49k    68.41%
  Latency Distribution
     50%       1.77 ms
     75%       2.23 ms
     90%       2.77 ms
     99%       4.78 ms
  595250 requests in 60099287, 63.04GB read
Requests/sec:   9904.44
Transfer/sec:      1.05GB
Running 1m test @ http://192.168.1.4/index111.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.22ms    3.89ms  45.00ms   88.78%
    Req/Sec     2.06k   116.53     2.36k    69.42%
  Latency Distribution
     50%      11.09 ms
     75%      11.75 ms
     90%      16.78 ms
     99%      29.03 ms
  491375 requests in 60004335, 52.04GB read
  Socket errors: connect 0, read 363, write 0, timeout 0
Requests/sec:   8188.99
Transfer/sec:      0.87GB
Running 1m test @ http://192.168.1.4/index111.html
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    67.99ms   32.18ms 514.87ms   92.92%
    Req/Sec     1.87k    89.17     2.16k    70.67%
  Latency Distribution
     50%      78.73 ms
     75%      82.82 ms
     90%      85.01 ms
     99%     167.71 ms
  447365 requests in 60023737, 47.39GB read
  Socket errors: connect 0, read 41, write 0, timeout 0
Requests/sec:   7453.13
Transfer/sec:    808.51MB
Running 1m test @ http://192.168.1.4/index111.html
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   233.65ms  707.16ms  18.18s    92.58%
    Req/Sec     1.87k   159.01     2.44k    67.79%
  Latency Distribution
     50%      81.26 ms
     75%      84.56 ms
     90%     507.88 ms
     99%    2588.90 ms
  445573 requests in 60040618, 47.20GB read
  Socket errors: connect 0, read 351, write 0, timeout 8
Requests/sec:   7421.19
Transfer/sec:    805.07MB
Running 1m test @ http://192.168.1.4/index111.html
  10 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.03ms  719.81us  10.27ms   87.72%
    Req/Sec     0.99k    97.68     1.26k    64.60%
  Latency Distribution
     50%       1.77 ms
     75%       2.12 ms
     90%       2.84 ms
     99%       5.11 ms
  591099 requests in 60015954, 62.60GB read
Requests/sec:   9849.03
Transfer/sec:      1.04GB
Running 1m test @ http://192.168.1.4/index111.html
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.03ms    3.79ms  45.09ms   91.46%
    Req/Sec   839.16     71.15     1.13k    75.70%
  Latency Distribution
     50%      11.23 ms
     75%      11.66 ms
     90%      12.16 ms
     99%      30.61 ms
  501228 requests in 60017287, 53.08GB read
  Socket errors: connect 0, read 37, write 0, timeout 0
Requests/sec:   8351.39
Transfer/sec:      0.88GB
Running 1m test @ http://192.168.1.4/index111.html
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    69.28ms   31.54ms 535.37ms   92.79%
    Req/Sec   734.98     61.85     2.16k    75.69%
  Latency Distribution
     50%      80.20 ms
     75%      83.08 ms
     90%      85.09 ms
     99%     167.23 ms
  439122 requests in 60072716, 46.52GB read
Requests/sec:   7309.84
Transfer/sec:    792.97MB
Running 1m test @ http://192.168.1.4/index111.html
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   268.60ms  941.42ms  26.83s    93.57%
    Req/Sec   738.91    313.25     1.48k    59.80%
  Latency Distribution
     50%      81.29 ms
     75%      84.06 ms
     90%     615.46 ms
     99%    2905.04 ms
  438224 requests in 60047832, 46.43GB read
  Socket errors: connect 0, read 30, write 0, timeout 8
Requests/sec:   7297.92
Transfer/sec:    791.71MB
Running 1m test @ http://192.168.1.4/index111.html
  20 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.03ms  715.86us   7.74ms   87.29%
    Req/Sec   495.16     68.47   676.00     62.03%
  Latency Distribution
     50%       1.78 ms
     75%       2.09 ms
     90%       2.86 ms
     99%       5.09 ms
  591738 requests in 60035260, 62.67GB read
Requests/sec:   9856.51
Transfer/sec:      1.04GB
Running 1m test @ http://192.168.1.4/index111.html
  20 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.06ms    3.79ms  45.13ms   91.81%
    Req/Sec   418.81     39.82   595.00     75.07%
  Latency Distribution
     50%      11.30 ms
     75%      11.68 ms
     90%      12.14 ms
     99%      30.51 ms
  500538 requests in 60033377, 53.01GB read
Requests/sec:   8337.66
Transfer/sec:      0.88GB
Running 1m test @ http://192.168.1.4/index111.html
  20 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    69.62ms   32.04ms 787.12ms   91.93%
    Req/Sec   365.76     42.46   757.00     68.97%
  Latency Distribution
     50%      79.95 ms
     75%      82.94 ms
     90%      85.36 ms
     99%     167.22 ms
  437311 requests in 60091637, 46.32GB read
Requests/sec:   7277.40
Transfer/sec:    789.41MB
Running 1m test @ http://192.168.1.4/index111.html
  20 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   262.34ms  836.01ms  18.27s    92.93%
    Req/Sec   384.13    215.50     2.42k    60.82%
  Latency Distribution
     50%      81.72 ms
     75%      84.55 ms
     90%     606.69 ms
     99%    3077.17 ms
  437213 requests in 60085599, 46.32GB read
  Socket errors: connect 0, read 12, write 0, timeout 16
Requests/sec:   7276.50
Transfer/sec:    789.37MB